{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 150, 150], "input_dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1/7x7_s2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 7, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 7}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "conv1/7x7_s2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_4"}, "inbound_nodes": [[["conv1/7x7_s2", 0, 0]]], "name": "zeropadding2d_4"}, {"class_name": "PoolHelper", "config": {"trainable": true, "name": "poolhelper_4"}, "inbound_nodes": [[["zeropadding2d_4", 0, 0]]], "name": "poolhelper_4"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["poolhelper_4", 0, 0]]], "name": "pool1/3x3_s2"}, {"class_name": "LRN", "config": {"name": "pool1/norm1", "k": 1, "trainable": true, "n": 5, "beta": 0.75, "alpha": 0.0001}, "inbound_nodes": [[["pool1/3x3_s2", 0, 0]]], "name": "pool1/norm1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool1/norm1", 0, 0]]], "name": "conv2/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["conv2/3x3_reduce", 0, 0]]], "name": "conv2/3x3"}, {"class_name": "LRN", "config": {"name": "conv2/norm2", "k": 1, "trainable": true, "n": 5, "beta": 0.75, "alpha": 0.0001}, "inbound_nodes": [[["conv2/3x3", 0, 0]]], "name": "conv2/norm2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_5"}, "inbound_nodes": [[["conv2/norm2", 0, 0]]], "name": "zeropadding2d_5"}, {"class_name": "PoolHelper", "config": {"trainable": true, "name": "poolhelper_5"}, "inbound_nodes": [[["zeropadding2d_5", 0, 0]]], "name": "poolhelper_5"}, {"class_name": "MaxPooling2D", "config": {"name": "pool2/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["poolhelper_5", 0, 0]]], "name": "pool2/3x3_s2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_3a/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_3a/3x3_reduce", 0, 0]]], "name": "inception_3a/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_3a/5x5_reduce", 0, 0]]], "name": "inception_3a/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_3a/pool", 0, 0]]], "name": "inception_3a/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_3a/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_3a/1x1", 0, 0], ["inception_3a/3x3", 0, 0], ["inception_3a/5x5", 0, 0], ["inception_3a/pool_proj", 0, 0]]], "name": "inception_3a/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_3b/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_3b/3x3_reduce", 0, 0]]], "name": "inception_3b/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_3b/5x5_reduce", 0, 0]]], "name": "inception_3b/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_3b/pool", 0, 0]]], "name": "inception_3b/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_3b/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_3b/1x1", 0, 0], ["inception_3b/3x3", 0, 0], ["inception_3b/5x5", 0, 0], ["inception_3b/pool_proj", 0, 0]]], "name": "inception_3b/output"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_6"}, "inbound_nodes": [[["inception_3b/output", 0, 0]]], "name": "zeropadding2d_6"}, {"class_name": "PoolHelper", "config": {"trainable": true, "name": "poolhelper_6"}, "inbound_nodes": [[["zeropadding2d_6", 0, 0]]], "name": "poolhelper_6"}, {"class_name": "MaxPooling2D", "config": {"name": "pool3/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["poolhelper_6", 0, 0]]], "name": "pool3/3x3_s2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/3x3_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 96, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/5x5_reduce", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/5x5_reduce"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4a/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "same"}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 208, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["inception_4a/3x3_reduce", 0, 0]]], "name": "inception_4a/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/5x5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["inception_4a/5x5_reduce", 0, 0]]], "name": "inception_4a/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/pool_proj", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["inception_4a/pool", 0, 0]]], "name": "inception_4a/pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4a/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4a/1x1", 0, 0], ["inception_4a/3x3", 0, 0], ["inception_4a/5x5", 0, 0], ["inception_4a/pool_proj", 0, 0]]], "name": "inception_4a/output"}, {"class_name": "AveragePooling2D", "config": {"name": "loss1/ave_pool", "trainable": true, "dim_ordering": "th", "pool_size": [5, 5], "strides": [3, 3], "border_mode": "valid"}, "inbound_nodes": [[["inception_4a/output", 0, 0]]], "name": "loss1/ave_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "loss1/conv", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "nb_row": 1}, "inbound_nodes": [[["loss1/ave_pool", 0, 0]]], "name": "loss1/conv"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["loss1/conv", 0, 0]]], "name": "flatten_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "loss1/fc_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "output_dim": 4096}, "inbound_nodes": [[["flatten_2", 0, 0]]], "name": "loss1/fc_1"}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["loss1/fc_1", 0, 0]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "loss1/fc_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 4096, "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "output_dim": 1024}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "loss1/fc_2"}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["loss1/fc_2", 0, 0]]], "name": "dropout_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "loss1/classifier", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": {"l2": 0.00019999999494757503, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "output_dim": 7}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "loss1/classifier"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["loss1/classifier", 0, 0]]], "name": "activation_2"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["activation_2", 0, 0]], "name": "model_2"}}